# Session 02

### Arithmetic Operations

In [2]:
r = 1500
t = 0.2

total = r * (1 + t)
total

1800.0

In [3]:
2!=5

True

and   or  not

In [4]:
(10>5) and  (10<5)

False

## Basic Data Structures

### List

In [5]:
sales = [100, 200, 150, 200]
sales

[100, 200, 150, 200]

In [11]:
sales[-1]

200

## Analytical context

### Tuple

In [1]:
coordinates = (40.18, 44.51)
coordinates

(40.18, 44.51)

## Dictionary

In [ ]:
customers = {
            "Alice": 30,
            "Bob": 25,
            "Charlie": 35,
            }

SyntaxError: ':' expected after dictionary key (4293036826.py, line 5)

In [5]:
customers

{'Alice': 30, 'Bob': 25, 'Charlie': 35}

In [1]:
import pandas as pd

In [15]:
data = {
    "Name": ["Alice", "Bob", "Charlie","Narek","Arpine"],   
    "Age": [30, 25, 35, 30, 28],
    "City": ["New York", "Los Angeles", "Chicago", "Boston","San Francisco"]
}

In [16]:
data["Name"]
data["Age"]

[30, 25, 35, 30, 28]

In [18]:
df=pd.DataFrame(data)

In [19]:
df.head()

      Name  Age           City
0    Alice   30       New York
1      Bob   25    Los Angeles
2  Charlie   35        Chicago
3    Narek   30         Boston
4   Arpine   28  San Francisco

In [20]:
type(df)

pandas.DataFrame

In [21]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      str
 1   Age     5 non-null      int64
 2   City    5 non-null      str
dtypes: int64(1), str(2)
memory usage: 252.0 bytes

In [22]:
df.shape

(5, 3)

In [23]:
list(df.columns)

['Name', 'Age', 'City']

In [24]:
df.head()

      Name  Age           City
0    Alice   30       New York
1      Bob   25    Los Angeles
2  Charlie   35        Chicago
3    Narek   30         Boston
4   Arpine   28  San Francisco

In [32]:
df[["Name", "Age"]]

      Name  Age
0    Alice   30
1      Bob   25
2  Charlie   35
3    Narek   30
4   Arpine   28

In [33]:
df["State"] = "Unknown"

In [34]:
df.head()

      Name  Age           City    State
0    Alice   30       New York  Unknown
1      Bob   25    Los Angeles  Unknown
2  Charlie   35        Chicago  Unknown
3    Narek   30         Boston  Unknown
4   Arpine   28  San Francisco  Unknown

In [35]:
df["Age"] = df["Age"] * 0.9

In [36]:
df.head()

      Name   Age           City    State
0    Alice  27.0       New York  Unknown
1      Bob  22.5    Los Angeles  Unknown
2  Charlie  31.5        Chicago  Unknown
3    Narek  27.0         Boston  Unknown
4   Arpine  25.2  San Francisco  Unknown